app/controllers/api/v1/cars_controller.rb

INSERT INTO "cars" ("year", "make", "model", "price", "person_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["year", 2022], ["make", "sdd"], ["model", "asf"], ["price", 12333], ["person_id", 4], ["created_at", "2022-06-10 09:01:02.665322"], ["updated_at", "2022-06-10 09:01:02.665322"]]
---
    def create
        car = Car.new car_params
        car.person_id = params[:person_id]
        car.save!

SELECT "cars".* FROM "cars" WHERE "cars"."person_id" = $1  [["person_id", 4]]
---
    def index
        cars = Car.where person_id: params[:person_id]

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def car
        @car ||= Car.find params[:id]